garyPenhook/PyAvrOCD/svd/avr128db32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTMUX</name>
      <description>Port Multiplexer</description>
      <baseAddress>0x008005E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACROUTEA</name>
          <description>AC route A</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AC0</name>
              <description>Analog Comparator 0 Output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>OUT: PA7</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC1</name>
              <description>Analog Comparator 1 Output</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>OUT: PA7</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC2</name>
              <description>Analog Comparator 2 Output</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>OUT: PA7</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCLROUTEA</name>
          <description>CCL route A</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT0</name>
              <description>CCL Look-Up Table 0 Signals</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>In: PA0, PA1, PA2 Out: PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>In: PA0, PA1, PA2 Out: PA6</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LUT1</name>
              <description>CCL Look-Up Table 1 Signals</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>In: PC0, PC1, PC2 Out: PC3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>In: PC0, PC1, PC2 Out: -</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LUT2</name>
              <description>CCL Look-Up Table 2 Signals</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>In: -, PD1, PD2 Out: PD3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>In: -, PD1, PD2 Out: PD6</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LUT3</name>
              <description>CCL Look-Up Table 3 Signals</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>In: PF0, PF1, PF2 Out: PF3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSYSROUTEA</name>
          <description>EVSYS route A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVOUTA</name>
              <description>Event Output A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTA: PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUTA: PA7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTC</name>
              <description>Event Output C</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTC: PC2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTD</name>
              <description>Event Output D</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTD: PD2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>EVOUTD: PD7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUTF</name>
              <description>Event Output F</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>EVOUTF: PF2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPIROUTEA</name>
          <description>SPI route A</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI0</name>
              <description>SPI0 Signals</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>MOSI: PA4, MISO: PA5, SCK: PA6, SS: PA7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 Signals</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>MOSI: PC0, MISO: PC1, SCK: PC2, SS: PC3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCAROUTEA</name>
          <description>TCA route A</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCA0</name>
              <description>TCA0 Signals</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>WOn: PA0, PA1, PA2, PA3, PA4, PA5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>WOn: PC0, PC1, PC2, PC3, -, -</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>WOn: -, PD1, PD2, PD3, PD4, PD5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>WOn: PF0, PF1, PF2, PF3, PF4, PF5</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCBROUTEA</name>
          <description>TCB route A</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCB0</name>
              <description>TCB0 Output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO: PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO: PF4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB1</name>
              <description>TCB1 Output</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO: PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>WO: PF5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCB2</name>
              <description>TCB2 Output</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WO: PC0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCDROUTEA</name>
          <description>TCD route A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCD0</name>
              <description>TCD0 Signals</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>WOx: PA4, PA5, PA6, PA7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>WOx: PF0, PF1, PF2, PF3</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TWIROUTEA</name>
          <description>TWI route A</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TWI0</name>
              <description>TWI0 Signals</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SDA: PA2, SCL: PA3. Dual mode: SDA: PC2, SCL: PC3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SDA: PA2, SCL: PA3. Dual mode: SDA: -, SCL: -.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>SDA: PC2, SCL: PC3. Dual mode: SDA: -, SCL: -.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWI1</name>
              <description>TWI1 Signals</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>SDA: PF2, SCL: PF3. Dual mode: SDA: -, SCL: -.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>SDA: PF2, SCL: PF3. Dual mode: SDA: -, SCL: -.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USARTROUTEA</name>
          <description>USART route A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART0</name>
              <description>USART0 Signals</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>TxD: PA0, RxD: PA1, XCK: PA2, XDIR: PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>TxD: PA4, RxD: PA5, XCK: PA6, XDIR: PA7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART1</name>
              <description>USART1 Signals</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>TxD: PC0, RxD: PC1, XCK: PC2, XDIR: PC3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART2</name>
              <description>USART2 Signals</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>TxD: PF0, RxD: PF1, XCK: PF2, XDIR: PF3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>TxD: PF4, RxD: PF5, XDIR: PF3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Not connected to any pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ZCDROUTEA</name>
          <description>ZCD route A</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ZCD0</name>
              <description>Zero Cross Detector 0 Output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>OUT: PA7</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
